[
  {
    "id": 0,
    "name": "Subway Busker",
    "description": "<html><p>A talented musician is playing guitar in the subway station. Their soulful melody fills the underground space. A small crowd has gathered, and a tip jar sits at their feet. Do you want to show your appreciation?</p></html>",
    "outcomes": {
      "0": {
        "name": "Generous Tip (+$0 to +$50 karma): 40%",
        "description": "<html><p>You drop $20 in the tip jar. The musician looks up and gives you a warm smile. 'Thank you, friend!' As you walk away, you notice they tucked something into your bag - a lottery ticket! You scratch it later... and win $50! Sometimes good karma pays off.</p></html>",
        "chance": 0.4,
        "result": 30
      },
      "1": {
        "name": "Small Tip (-$5): 40%",
        "description": "<html><p>You toss a few dollars into the jar. The musician nods appreciatively and continues their set. You enjoyed the music and feel good about supporting street artists.</p></html>",
        "chance": 0.4,
        "result": -5
      },
      "2": {
        "name": "Walk Past ($0): 20%",
        "description": "<html><p>You're in a hurry and walk past without stopping. The music fades as you head toward your destination. Maybe next time.</p></html>",
        "chance": 0.2,
        "result": 0
      }
    }
  },
  {
    "id": 1,
    "name": "Office Coffee Machine Jackpot",
    "description": "<html><p>The office coffee machine is acting strangely. It's making unusual whirring sounds and lights are flashing. Someone left their change in the coin return slot, and the machine seems to be malfunctioning.</p></html>",
    "outcomes": {
      "0": {
        "name": "Machine Dispenses Everything (+$25): 30%",
        "description": "<html><p>You press a random button and the machine goes haywire! It dispenses three coffees, two hot chocolates, and spits out all its change. You collect the beverages to share with coworkers and pocket the excess change. Total score: +$25!</p></html>",
        "chance": 0.3,
        "result": 25
      },
      "1": {
        "name": "Free Coffee (+$5): 50%",
        "description": "<html><p>The machine gives you a free coffee! It must have had leftover credit from the previous user. You grab the forgotten change too. A small but pleasant surprise.</p></html>",
        "chance": 0.5,
        "result": 5
      },
      "2": {
        "name": "Machine Eats Your Money (-$10): 20%",
        "description": "<html><p>You try to get a drink but the machine swallows your money and gives nothing in return. The 'Out of Order' sign falls down mockingly. Great, now you're out $10 and still caffeine-deprived.</p></html>",
        "chance": 0.2,
        "result": -10
      }
    }
  },
  {
    "id": 2,
    "name": "Grocery Store Chaos",
    "description": "<html><p>A shopping cart collision has caused a domino effect of disaster in Aisle 5! Cans are rolling everywhere, a jar of pickles has shattered, and the store manager is frantically looking for help. This could be your chance to be a hero... or quietly slip away.</p></html>",
    "outcomes": {
      "0": {
        "name": "Hero's Reward (+$75): 25%",
        "description": "<html><p>You jump in to help, catching falling cans like a grocery-aisle superhero! The manager is so impressed, they give you a $50 store gift card AND waive your current purchase. 'We need more customers like you!' Total savings: $75!</p></html>",
        "chance": 0.25,
        "result": 75
      },
      "1": {
        "name": "Small Token of Appreciation (+$15): 45%",
        "description": "<html><p>You help clean up the mess. The grateful manager hands you a $15 discount coupon. 'Thanks for being a good sport!' Nothing spectacular, but honest work.</p></html>",
        "chance": 0.45,
        "result": 15
      },
      "2": {
        "name": "Pickle Juice Catastrophe (-$40): 30%",
        "description": "<html><p>You try to help but slip on the pickle juice! Your phone flies out of your pocket and cracks on the floor. The manager apologetically offers a coupon, but it doesn't cover the screen repair cost. Net loss: $40.</p></html>",
        "chance": 0.3,
        "result": -40
      }
    }
  },
  {
    "id": 3,
    "name": "Street Performer's Challenge",
    "description": "<html><p>A street magician stops you with a confident grin. 'Pick a card, any card! If I guess wrong, I'll give you $100. If I guess right, you owe me $20. What do you say, want to test your luck?'</p></html>",
    "outcomes": {
      "0": {
        "name": "You Win! (+$100): 15%",
        "description": "<html><p>You pick the Seven of Diamonds. The magician squints, shuffles dramatically, and pulls out... the Three of Clubs! 'Impossible!' he exclaims, genuinely shocked. You've beaten the master! He hands over $100, muttering about needing more practice.</p></html>",
        "chance": 0.15,
        "result": 100
      },
      "1": {
        "name": "Magic Wins (-$20): 60%",
        "description": "<html><p>'Is THIS your card?' The magician reveals your exact card with a theatrical flourish. The gathering crowd applauds. You grudgingly hand over $20 - fair is fair. At least you were entertained!</p></html>",
        "chance": 0.6,
        "result": -20
      },
      "2": {
        "name": "Tie - Free Show ($0): 25%",
        "description": "<html><p>The magician pulls out... wait, is that YOUR card? No, it's one off! But then he does another trick and nails it. You both agree to call it even. No money changes hands, but you got a free magic show!</p></html>",
        "chance": 0.25,
        "result": 0
      }
    }
  },
  {
    "id": 4,
    "name": "Lost Wallet Discovery",
    "description": "<html><p>While walking down the street, you spot a leather wallet on the ground. It's thick with cash! A quick look shows $200 inside along with an ID card. You could pocket the cash, try to return it, or turn it in to the police.</p></html>",
    "outcomes": {
      "0": {
        "name": "Generous Reward (+$150): 20%",
        "description": "<html><p>You track down the owner using the ID. Turns out it belongs to a wealthy business owner who was on their way to close a major deal. They're incredibly grateful and reward you with $150! 'Honesty is rare these days,' they say.</p></html>",
        "chance": 0.2,
        "result": 150
      },
      "1": {
        "name": "Modest Thanks (+$30): 50%",
        "description": "<html><p>You return the wallet to its owner - a college student who nearly cries with relief. They can't afford much but insist you take $30 as thanks. 'You saved my whole month's budget!'</p></html>",
        "chance": 0.5,
        "result": 30
      },
      "2": {
        "name": "No Good Deed Unpunished (-$0): 30%",
        "description": "<html><p>You spend an hour trying to find the owner, eventually turning it in to the police. No reward, no thank you - just the satisfaction of doing the right thing. At least your conscience is clear!</p></html>",
        "chance": 0.3,
        "result": 0
      }
    }
  },
  {
    "id": 5,
    "name": "Subway Delay Lottery",
    "description": "<html><p>The subway announcement crackles: 'Attention passengers, due to signal problems, all trains are delayed by 30 minutes.' A frustrated businessman next to you sighs and offers a deal: 'Bet you $50 the next train comes in under 15 minutes. I've got somewhere to be!'</p></html>",
    "outcomes": {
      "0": {
        "name": "Train Arrives Early! (+$50): 35%",
        "description": "<html><p>Against all odds, a train pulls up in just 12 minutes! The businessman groans but honors his bet, slapping a $50 bill in your hand. 'Should've known better than to bet against Murphy's Law in reverse!' he laughs.</p></html>",
        "chance": 0.35,
        "result": 50
      },
      "1": {
        "name": "Delays Continue (-$50): 40%",
        "description": "<html><p>Twenty-five minutes pass. No train. You hand over $50 to the now-smug businessman. 'Transit authority never disappoints in disappointing,' he chuckles. At least you have company in your misery.</p></html>",
        "chance": 0.4,
        "result": -50
      },
      "2": {
        "name": "Train Breaks Down ($0): 25%",
        "description": "<html><p>A train arrives at the 14-minute mark... but breaks down before it can open its doors! Neither of you wins, and you both laugh at the absurdity. 'Call it a draw,' the businessman says, pocketing his money.</p></html>",
        "chance": 0.25,
        "result": 0
      }
    }
  },
  {
    "id": 6,
    "name": "Suspicious Stock Tip",
    "description": "<html><p>A well-dressed stranger in the office lobby pulls you aside. 'Hey, I work in finance. Got insider info - TechCorp stock is about to skyrocket. Invest now and thank me later!' They wink and walk away before you can respond. Sounds too good to be true...</p></html>",
    "outcomes": {
      "0": {
        "name": "The Tip Was Real! (+$200): 15%",
        "description": "<html><p>You take a chance and buy some shares. Two days later, TechCorp announces a groundbreaking product and the stock doubles! You cash out quickly, netting $200 in pure profit. Sometimes the suspicious tips are legit!</p></html>",
        "chance": 0.15,
        "result": 200
      },
      "1": {
        "name": "Pump and Dump Scam (-$100): 55%",
        "description": "<html><p>You invest $100 in TechCorp. The next day, the stock plummets as all the 'insiders' dump their shares. Classic pump and dump scheme - you've been had. Lesson learned: if it sounds too good to be true...</p></html>",
        "chance": 0.55,
        "result": -100
      },
      "2": {
        "name": "You Ignore It ($0): 30%",
        "description": "<html><p>You wisely decide not to act on random tips from strangers. Later, you see news about TechCorp's wild stock fluctuations and feel relieved you stayed out of it. Safe and sound!</p></html>",
        "chance": 0.3,
        "result": 0
      }
    }
  },
  {
    "id": 7,
    "name": "The Mysterious Cat",
    "description": "<html><p>A fluffy orange cat meows at you from an alleyway. It seems well-groomed but has no collar. As you approach, it runs a few steps, then looks back expectantly. It clearly wants you to follow...</p></html>",
    "outcomes": {
      "0": {
        "name": "Hidden Treasure! (+$80): 20%",
        "description": "<html><p>You follow the cat through a maze of alleys. It stops at a dumpster and meows insistently. Inside, you find a vintage wallet that someone tossed - probably by accident. It contains $80! The cat purrs smugly. What a good kitty!</p></html>",
        "chance": 0.2,
        "result": 80
      },
      "1": {
        "name": "Grateful Owner (+$25): 40%",
        "description": "<html><p>The cat leads you to a worried-looking person putting up 'LOST CAT' posters. They're overjoyed to see their pet! 'Mr. Whiskers! Oh, thank you so much!' They reward you with $25 for your kindness.</p></html>",
        "chance": 0.4,
        "result": 25
      },
      "2": {
        "name": "Just a Cat Being a Cat ($0): 40%",
        "description": "<html><p>You follow the cat for five minutes through winding alleys... and it leads you to an empty cardboard box. The cat hops in, curls up, and falls asleep. That's it. That's the adventure. At least you pet a cat today.</p></html>",
        "chance": 0.4,
        "result": 0
      }
    }
  },
  {
    "id": 8,
    "name": "Office Printer Emergency",
    "description": "<html><p>The office printer is jammed again, and your boss needs those reports YESTERDAY! You're the only one around. The last person who tried to fix it ended up covered in toner. Do you dare attempt the repair?</p></html>",
    "outcomes": {
      "0": {
        "name": "IT Hero Bonus (+$50): 25%",
        "description": "<html><p>You channel your inner tech support and clear the jam perfectly! The printer whirs back to life, and your boss is impressed. 'I'm putting you down for an extra $50 in your next paycheck,' they declare. Victory!</p></html>",
        "chance": 0.25,
        "result": 50
      },
      "1": {
        "name": "Fixed, No Fanfare (+$10): 45%",
        "description": "<html><p>You carefully extract the jammed paper without incident. Your boss nods curtly and grabs the printouts. 'Thanks,' they mutter, sliding you a $10 bill for coffee. Not much recognition, but at least you helped!</p></html>",
        "chance": 0.45,
        "result": 10
      },
      "2": {
        "name": "Toner Explosion (-$30): 30%",
        "description": "<html><p>You pull out the paper and... POOF! Black toner explodes everywhere! Your shirt, your face, the walls - everything is covered. Dry cleaning and replacement clothes cost you $30. At least the printer works now?</p></html>",
        "chance": 0.3,
        "result": -30
      }
    }
  },
  {
    "id": 9,
    "name": "The Food Truck Gamble",
    "description": "<html><p>A new food truck has parked on the street with a sign: 'Mystery Meal Monday - $15! Could be a gourmet feast or a simple sandwich. Feeling lucky?' The smell wafting out is incredible, but you can't quite identify it...</p></html>",
    "outcomes": {
      "0": {
        "name": "Gourmet Jackpot (+$35): 30%",
        "description": "<html><p>You get a stunning wagyu beef bowl worth at least $50! The chef winks, 'You've got good luck, friend!' You devour every bite. Best $15 ever spent - practically a $35 gain in food value!</p></html>",
        "chance": 0.3,
        "result": 35
      },
      "1": {
        "name": "Decent Meal (+$0): 45%",
        "description": "<html><p>You receive a perfectly fine chicken wrap. It's tasty and filling - about what you'd expect for $15. No regrets, but no fireworks either. A fair deal!</p></html>",
        "chance": 0.45,
        "result": 0
      },
      "2": {
        "name": "Sad Sandwich (-$15): 25%",
        "description": "<html><p>Your 'mystery meal' is a sad, deflated PB&J sandwich. That's it. Just... a sandwich. The chef shrugs apologetically. 'Can't win 'em all!' You're out $15 for something you could've made for $2 at home.</p></html>",
        "chance": 0.25,
        "result": -15
      }
    }
  }
]
